In [3]:
s=int(input("Enter Standard Time"))
t=int(input("Enter Time"))
r=int(input("Enter Rate"))
total_earnings=t*r+((s-t)*(1/2))*r
print(total_earnings)

Enter Standard Time 20
Enter Time 15
Enter Rate 2

35.0

In [4]:
import pandas as c

In [5]:
x=c.read_excel("14-12-2021.xlsx")

In [6]:
x

    Name   T   S    R
0  Colin  45  67  600

In [13]:
t=x.loc[0,"T"]
s=x.loc[0,"S"]
r=x.loc[0,"R"]
total_earnings=t*r+((s-t)*(1/2))*r
print(total_earnings)

33600.0

In [15]:
x=c.read_excel("miles 14-12-2021.xlsx")

In [16]:
x

      N   T    W  S
0  5000  19  420  2

In [18]:
n=x.loc[0,"N"]
t=x.loc[0,"T"]
w=x.loc[0,"W"]
s=x.loc[0,"S"]
manpower=((n*t)/w)/s
print("ManPower:",manpower)
manpower_for_85=manpower/0.85

ManPower: 113.0952380952381

In [21]:
x=c.read_excel("miles 14-12-2021.xlsx")

In [22]:
x

      N   T    W   S  a  b  c
0  5000  19  420   2  5  8  6
1   704   8  470   2  1  4  3
2  1874  10  461   7  3  5  2
3  2309  12  266  10  5  6  1

In [28]:
D=0
d=0
for y in x.index:
        n=x.loc[D,"N"]
        t=x.loc[D,"T"]
        w=x.loc[D,"W"]
        s=x.loc[D,"S"]
        D=D+d
        d=d+1
        manpower=((n*t)/w)/s
        print("ManPower:",manpower)
        manpower_for_85=manpower/0.85
        print(manpower_for_85)

ManPower: 113.0952380952381
133.05322128851543
ManPower: 113.0952380952381
133.05322128851543
ManPower: 5.991489361702127
7.048811013767209
ManPower: 10.416541353383458
12.254754533392305